<a href="https://colab.research.google.com/github/schase15/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/Steven_Chase_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-03-11 19:09:27--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.113.189
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.113.189|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  17.0MB/s    in 13s

2020-03-11 19:09:40 (15.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import pandas as pd

In [0]:
aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [9]:
# I used the following code to look at each df and wrote down what I need below

print(departments.shape)
departments.head

(21, 2)

<bound method NDFrame.head of     department_id       department
0               1           frozen
1               2            other
2               3           bakery
3               4          produce
4               5          alcohol
5               6    international
6               7        beverages
7               8             pets
8               9  dry goods pasta
9              10             bulk
10             11    personal care
11             12     meat seafood
12             13           pantry
13             14        breakfast
14             15     canned goods
15             16       dairy eggs
16             17        household
17             18           babies
18             19           snacks
19             20             deli
20             21          missing>

In [0]:
# I need product_id and product_name from products dataframe
# I need product_id and order_id from order_products dataframe

In [25]:
# First I need to concat the order_products__prior and order_products__train
# And make a subset of only the two columns I need

order_products__prior = order_products__prior[['order_id', 'product_id']]
order_products__train = order_products__train[['order_id', 'product_id']]

order_products_subset = pd.concat([order_products__prior, order_products__train])
order_products_subset.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [23]:
# Make a subset of only the two columns I need from products
products_subset = products[['product_id', 'product_name']]
products_subset.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [30]:
# Merge products_subset and order_products_subset

freq_of_products = pd.merge(products_subset, order_products_subset, on= 'product_id')

freq_of_products

          product_id                product_name  order_id
0                  1  Chocolate Sandwich Cookies      1107
1                  1  Chocolate Sandwich Cookies      5319
2                  1  Chocolate Sandwich Cookies      7540
3                  1  Chocolate Sandwich Cookies      9228
4                  1  Chocolate Sandwich Cookies      9273
...              ...                         ...       ...
33819101       49688      Fresh Foaming Cleanser   3401313
33819102       49688      Fresh Foaming Cleanser    655800
33819103       49688      Fresh Foaming Cleanser   2198380
33819104       49688      Fresh Foaming Cleanser   2508423
33819105       49688      Fresh Foaming Cleanser   2986153

[33819106 rows x 3 columns]

In [36]:
# Value count of freq_of_products
# Show top 10

freq_of_products['product_name'].value_counts().head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [53]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [54]:
# table2 -> tidy

# Reset index
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [55]:
#Melt to tidy format 

tidy2 = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [56]:
# Rename columns

tidy2 = tidy2.rename(columns={
    'index': 'Treatment', 
    'variable': 'Name', 
    'value': 'Result'
})
tidy2

    Treatment          Name  Result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [57]:
# Clean up treatment column

tidy2['Treatment'] = tidy2['Treatment'].str.replace('treatment', '')

tidy2

  Treatment          Name  Result
0         a    John Smith     NaN
1         b    John Smith     2.0
2         a      Jane Doe    16.0
3         b      Jane Doe    11.0
4         a  Mary Johnson     3.0
5         b  Mary Johnson     1.0

In [61]:
# tidy -> table2

wide2 = tidy2.pivot_table(index= 'Treatment', columns= 'Name', values= 'Result')
wide2

Name       Jane Doe  John Smith  Mary Johnson
Treatment
a              16.0         NaN           3.0
b              11.0         2.0           1.0

In [0]:
# Flights data

import seaborn as sns

In [66]:
flights = sns.load_dataset('flights')
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [67]:
# Flights Pivot Table

flights_pivot = flights.pivot_table(index= 'year', columns= 'month', values= 'passengers')
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [69]:
# merge freq_of_products with subset from orders
# need columns order_hour_of_day and order_id
# use order_id as key

order_subset = orders[['order_hour_of_day', 'order_id']]
order_subset

         order_hour_of_day  order_id
0                        8   2539329
1                        7   2398795
2                       12    473747
3                        7   2254736
4                       15    431534
...                    ...       ...
3421078                 18   2266710
3421079                 10   1854736
3421080                 12    626363
3421081                 12   2977660
3421082                 14    272231

[3421083 rows x 2 columns]

In [70]:
hour_of_products = pd.merge(freq_of_products, order_subset, on= 'order_id')

hour_of_products

          product_id  ... order_hour_of_day
0                  1  ...                11
1                769  ...                11
2               6184  ...                11
3               8048  ...                11
4               9007  ...                11
...              ...  ...               ...
33819101       49683  ...                10
33819102       49683  ...                10
33819103       49683  ...                19
33819104       49687  ...                18
33819105       49688  ...                 8

[33819106 rows x 4 columns]

In [84]:
# Filter by order_hour_of_day >= 22     (10:00pm)
# Set that to a new dataset
# value count, show top 25

late_ordered_products = hour_of_products[(hour_of_products['order_hour_of_day'] > 12)]
late_ordered_products

          product_id  ... order_hour_of_day
17                 1  ...                14
18              9076  ...                14
19             14161  ...                14
20             16797  ...                14
21             19972  ...                14
...              ...  ...               ...
33819097       49683  ...                14
33819098       49683  ...                18
33819100       49683  ...                15
33819103       49683  ...                19
33819104       49687  ...                18

[19166607 rows x 4 columns]

In [87]:
# Freq ordered after 12

late_ordered_freq = late_ordered_products['product_name'].value_counts().head(25)
late_ordered_freq

Banana                      275720
Bag of Organic Bananas      221476
Organic Strawberries        157296
Organic Baby Spinach        143816
Organic Hass Avocado        126847
Organic Avocado             106522
Large Lemon                  90751
Limes                        84053
Strawberries                 82881
Organic Whole Milk           80125
Organic Raspberries          79601
Organic Yellow Onion         66821
Organic Garlic               65612
Organic Zucchini             62881
Organic Blueberries          59432
Cucumber Kirby               57974
Organic Lemon                52313
Organic Grape Tomatoes       51014
Organic Fuji Apple           50205
Organic Cucumber             49145
Apple Honeycrisp Organic     48111
Seedless Red Grapes          48068
Honeycrisp Apple             46281
Organic Baby Carrots         44692
Yellow Onions                44090
Name: product_name, dtype: int64

In [85]:
# Ordered before or at 12

early_ordered_products = hour_of_products[(hour_of_products['order_hour_of_day'] <= 12)]
early_ordered_products

          product_id                product_name  order_id  order_hour_of_day
0                  1  Chocolate Sandwich Cookies      1107                 11
1                769      Sliced American Cheese      1107                 11
2               6184                 Clementines      1107                 11
3               8048     Packaged Grape Tomatoes      1107                 11
4               9007              Frosted Flakes      1107                 11
...              ...                         ...       ...                ...
33819094       49683              Cucumber Kirby   3345974                 10
33819099       49683              Cucumber Kirby   1132592                 12
33819101       49683              Cucumber Kirby   2910889                 10
33819102       49683              Cucumber Kirby   3015609                 10
33819105       49688      Fresh Foaming Cleanser   1288677                  8

[14652499 rows x 4 columns]

In [88]:
early_ordered_freq = early_ordered_products['product_name'].value_counts().head(25)
early_ordered_freq

Banana                        215571
Bag of Organic Bananas        173454
Organic Strawberries          118281
Organic Baby Spinach          107889
Organic Hass Avocado           94030
Organic Avocado                77702
Large Lemon                    70041
Strawberries                   66564
Organic Raspberries            63002
Organic Whole Milk             62688
Limes                          62607
Organic Yellow Onion           50895
Organic Garlic                 48324
Organic Zucchini               46531
Organic Blueberries            45594
Organic Fuji Apple             42684
Cucumber Kirby                 41754
Organic Half & Half            39534
Apple Honeycrisp Organic       39161
Organic Lemon                  38938
Seedless Red Grapes            38680
Organic Grape Tomatoes         37064
Honeycrisp Apple               37039
Sparkling Water Grapefruit     35934
Organic Cucumber               35860
Name: product_name, dtype: int64

In [0]:
# Create a for loop to divide late_ordered_freq by early_ordered_freq to get a percentage
# sort by highest percentage, top 25

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####